Repository: Phantom202x/FMH
Catalog: frontend/lib/l10n/app_*.arb
Languages: ar, fr

source: Hello World
ar: مرحبا بالعالم!

# admin_button
source: Admin
ar: مسؤول

# guest_button
source: Guest
ar: زائر
fr: Invite

# login_button
source: Login
ar: تسجيل دخول
fr: Se connecter

# admin_login_title
source: Login to your admin account
ar: تسجيل دخول المسؤول
fr: Connectez-vous a votre compte admin

# email_hint
source: Email
ar: البريد الإلكتروني

# password_hint
source: Password
ar: كلمة المرور
fr: Mot de passe

# create_your_password
source: Create you password
ar: إنشاء كلمة المرور الخاصة بك
fr: Créez votre mot de passe

# name_hint
source: Full Name
ar: الاسم
fr: Nom complet

source: Pick Nationality
ar: اختر الجنسية
fr: Choisir la nationalite

# phone_hint
source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

# form_validate_full_name
source: Full name can't be empty
ar: الاسم الكامل لا يمكن ان يكون فارغا
fr: Le nom complet est obligatoire

# form_validate_email
source: Email can't be empty
ar: البريد الإلكتروني لا يمكن ان يكون فارغا
fr: L'email est obligatoire

# form_validate_password
source: Password can't be empty
ar: كلمة المرور لا يمكن ان تكون فارغة
fr: Le mot de passe est obligatoire

# form_validate_phone
source: Phone number can't be empty
ar: رقم الهاتف لا يمكن ان يكون فارغا
fr: Le numéro de téléphone est obligatoire

# form_validate_nationality
source: Please select your nationality
ar: الجنسية لا يمكن ان تكون فارغة
fr: La nationalite est obligatoire

# form_validate
source: Please fill all the fields
ar: يرجى تعبئة جميع الحقول
fr: Veuillez remplir tous les champs

source: Please confirm your password
ar: يرجى تأكيد كلمة المرور الخاصة بك
fr: يرجى تأكيد كلمة المرور الخاصة بك

source: Delete My Account
ar: حذف حسابي
fr: Supprimer mon compte

# alert_notif_title
source: Alert
ar: تحذير
fr: Alerte

# alert_notif_msg
source: a missing person was reported
ar: حدث خطأ في تسجيل الدخول
fr: Une personne manquante a été détectée

source: Hi
ar: مرحبا
fr: Bienvenue

# welcome_message
source: What do you want to do today?
ar: مرحبا
fr: Que souhaitez-vous faire aujourd'hui?

# report_confirmation
source: Are you sure you want to report a missing person?
ar: هل أنت متأكد من أنك تريد إرسال التقرير؟
fr: Êtes-vous sûr de vouloir créer un rapport?

source: Yes
ar: نعم
fr: Oui

source: No
ar: لا
fr: Non

# cant_find_hadj
source: I can't find my hadj
ar: لا يمكن العثور على الحاج
fr: Je ne peux pas trouver mon hadj

# no_image_taken
source: No image was taken
ar: لا يوجد صورة
fr: Aucune image prise

# found_hadj
source: You found a missing hadj
ar: تم العثور على الحاج
fr: J'ai trouvé un hadj

source: Scan face
ar: اسكن الوجه
fr: Scanner un visage

# face_scan_title
source: Scan full face
ar: تسجيل الوجه
fr: Scanne de visage

source: No match found
ar: لم يتم العثور على مطابقة
fr: Pas de correspondance trouvée

source: Match found
ar: تم العثور على مطابقة
fr: Correspondance trouvée

source: No face detected
ar: لا يوجد وجه
fr: Aucune visage détecté

# make_sure_face
source: Make sure the face is fully visible in the frame
ar: تأكد من وجود الوجه
fr: Assurez-vous que le visage est bien visible

source: Scan again
ar: تسجيل الوجه مرة أخرى
fr: Scannez à nouveau

source: Back
ar: رجوع
fr: Retour

source: Notifications
ar: الإشعارات

source: Missing person alert
ar: تحذير إنسان غير معروف
fr: Alerte de personne manquante

source: Date
ar: التاريخ

# missging_person_reported
source: A missing person has been reported
ar: تقرير إنسان غير معروف
fr: Rapport de personne manquante

source: Name
ar: الاسم
fr: Nom

source: Nationality
ar: الجنسية
fr: Nationalite

# phone
source: Phone number
ar: الهاتف
fr: Téléphone

source: Open full report
ar: افتح التقرير الكامل
fr: Ouvrir le rapport complet

source: Send report
ar: ارسال التقرير
fr: Envoyer le rapport

source: Age
ar: العمر

source: Gender
ar: الجنس
fr: Genre

source: Blood type
ar: نوع الدم
fr: Groupe sanguin

source: Emergency contact
ar: جهة التواصل الطوارئ
fr: Contact d'urgence

source: Illness
ar: الأمراض
fr: Maladie

source: Call emergency
ar: اتصل بالطوارئ
fr: Appeler l'urgence

# settings_title
source: Settings
ar: الإعدادات
fr: Préférences

source: Profile
ar: الملف الشخصي

source: Language
ar: اللغة

source: Logout
ar: تسجيل الخروج
fr: Se déconnecter

source: Profile overview
ar: معلومات الملف الشخصي
fr: Aperçu du profile

source: Full name
ar: الاسم الكامل
fr: Nom complet

source: Languages
ar: اللغات

source: English
ar: الانجليزية
fr: Anglais

source: Arabic
ar: العربية
fr: Arabe

source: French
ar: الفرنسية
fr: Francais

source: Notification
ar: الإشعارات

source: Face scanning guide
ar: إرشادات تسجيل الوجه
fr: Guide de scannage de visage

# distance_message
source: - the distance between the person and the camera should be between 30cm to 50cm
ar: تم تسجيل الوجه بنجاح
fr: - La distance entre la caméra et le visage doit être comprise entre 30cm et 50cm

source: Got it
ar: حسنا
fr: J'ai compris
